# StartZJustification Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StartZJustification Property
ParameterTypeId Class See Also
---
"Start z Justification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StartZJustification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StartZJustification As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StartZJustification {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace